[
  {
    "id": "generic-sidebar",
    "name": "Generic Sidebar",
    "version": "1.0.0",
    "status": "Active",
    "priority": "Normal",
    "category": "Generic Tools",
    "description": "A reusable, collapsible sidebar navigation component designed for Dynamics 365 model-driven apps and Power Pages. Provides consistent left-nav patterns across projects.",
    "longDescription": "Generic.Sidebar is a standalone navigation component that replicates the Dynamics 365 sidebar pattern. It supports collapsible groups, active state indicators, and theme-aware styling. Built with vanilla HTML/CSS/JS for maximum portability across projects.\n\nKey features include:\n- Collapsible navigation groups\n- Active route highlighting with left-edge indicator\n- Theme-aware (dark/light/D365 modes)\n- Zero dependencies — drop-in ready\n- Responsive collapse to icon-only mode at 64px",
    "repoUrl": "https://github.com/bradlaw76/Generic.Sidebar",
    "screenshots": [],
    "tags": ["Navigation", "UI Component", "Dynamics 365"],
    "dateCreated": "2025-09-23",
    "lastUpdated": "2025-09-23",
    "origin": "Web"
  },
  {
    "id": "copilot-studio-budgetary-cost-estimator",
    "name": "Copilot Studio Budgetary Cost Estimator",
    "version": "1.0.0",
    "status": "Active",
    "priority": "High",
    "category": "Generic Tools",
    "description": "An interactive cost estimation tool for Microsoft Copilot Studio deployments. Helps teams scope budgetary requirements for AI agent projects.",
    "longDescription": "The Copilot Studio Budgetary Cost Estimator provides a self-service calculator for estimating the cost of deploying Microsoft Copilot Studio agents. It factors in message volumes, channel types, generative AI usage, and licensing tiers to produce budgetary estimates.\n\nDesigned for pre-sales, solution architects, and project managers who need quick cost scoping without deep licensing expertise.",
    "repoUrl": "https://github.com/bradlaw76/CopilotStudioBedgetaryCostEstimator",
    "screenshots": [],
    "tags": ["Copilot Studio", "Cost Estimation", "Licensing"],
    "dateCreated": "2025-02-01",
    "lastUpdated": "2026-02-02",
    "origin": "Web"
  },
  {
    "id": "teleprompter",
    "name": "Teleprompter",
    "version": "1.0.0",
    "status": "Active",
    "priority": "Normal",
    "category": "Generic Tools",
    "description": "A browser-based teleprompter application for presentations, demos, and video recordings. Adjustable speed, font size, and mirroring options.",
    "longDescription": "A lightweight, browser-based teleprompter tool built for demo recordings and presentation delivery. Features adjustable scroll speed, font sizing, text mirroring (for physical teleprompter rigs), and keyboard controls.\n\nNo installation required — runs directly in any modern browser. Designed for quick use during customer demos and internal training recordings.",
    "repoUrl": "https://github.com/bradlaw76/Teleprompter",
    "screenshots": [],
    "tags": ["Productivity", "Presentations", "Demo Tools"],
    "dateCreated": "2025-10-03",
    "lastUpdated": "2025-10-03",
    "origin": "Web"
  },
  {
    "id": "dynamics-contact-center-whitepaper",
    "name": "Dynamics Contact Center White Paper",
    "version": "1.0.0",
    "status": "Active",
    "priority": "High",
    "category": "Publications",
    "description": "A comprehensive white paper on Dynamics 365 Contact Center — architecture, capabilities, and deployment guidance. Published as a static GitHub Pages site.",
    "longDescription": "This white paper provides an in-depth overview of Microsoft Dynamics 365 Contact Center, covering the platform architecture, unified routing, Copilot integration, omnichannel capabilities, and deployment best practices.\n\nPublished as a responsive GitHub Pages site with professional formatting. Serves as a go-to reference for customers and internal stakeholders evaluating the Contact Center solution.",
    "repoUrl": "https://github.com/bradlaw76/DynamicsContactCenter-WhitePaper",
    "screenshots": [],
    "tags": ["Dynamics 365", "Contact Center", "White Paper"],
    "dateCreated": "2025-05-05",
    "lastUpdated": "2025-05-05",
    "origin": "Web"
  },
  {
    "id": "contact-center-mcp",
    "name": "Contact Center MCP",
    "version": "1.0.0",
    "status": "Active",
    "priority": "Normal",
    "category": "Generic Tools",
    "description": "Model Context Protocol (MCP) integration for Dynamics 365 Contact Center. Enables AI agents to interact with contact center data and workflows.",
    "longDescription": "ContactCenterMCP provides a Model Context Protocol server for Dynamics 365 Contact Center environments. It exposes contact center entities (cases, queues, agents, conversations) as MCP resources, enabling Copilot and third-party AI agents to query, summarize, and act on live contact center data.\n\nConnects to a Dynamics 365 org and provides structured context for AI-powered workflows.",
    "repoUrl": "https://github.com/bradlaw76/ContactCenterMCP",
    "screenshots": [],
    "tags": ["MCP", "Dynamics 365", "Contact Center", "AI"],
    "dateCreated": "2025-05-14",
    "lastUpdated": "2025-05-14",
    "origin": "Web"
  },
  {
    "id": "snippets",
    "name": "Snippets",
    "version": "1.0.0",
    "status": "Active",
    "priority": "Low",
    "category": "Development",
    "description": "A curated collection of reusable code snippets, templates, and patterns used across projects. Quick-reference library for common tasks.",
    "longDescription": "A living repository of code snippets, boilerplate templates, and reusable patterns. Covers HTML/CSS/JS patterns, Power Platform formulas, API call templates, and common configuration blocks.\n\nOrganized for fast lookup during development sessions. Continuously updated as new patterns emerge from project work.",
    "repoUrl": "https://github.com/bradlaw76/Snippets",
    "screenshots": [],
    "tags": ["Code Snippets", "Templates", "Reference"],
    "dateCreated": "2025-02-09",
    "lastUpdated": "2026-02-09",
    "origin": "Web"
  },
  {
    "id": "powerbi",
    "name": "Power BI",
    "version": "1.0.0",
    "status": "Active",
    "priority": "Normal",
    "category": "Development",
    "description": "Power BI reports, templates, and dashboard examples. Reference implementations for common reporting patterns.",
    "longDescription": "A collection of Power BI report templates, dashboard designs, and DAX patterns. Includes reference implementations for common business reporting scenarios.\n\nServes as a starting point for new Power BI projects and a showcase of visualization techniques.",
    "repoUrl": "https://github.com/bradlaw76/PowerBi",
    "screenshots": [],
    "tags": ["Power BI", "Reporting", "Dashboards"],
    "dateCreated": "2026-02-09",
    "lastUpdated": "2026-02-09",
    "origin": "Web"
  },
  {
    "id": "speckkit-project-development",
    "name": "SpeckKit Project Development",
    "version": "1.0.0",
    "status": "Active",
    "priority": "High",
    "category": "Development",
    "description": "The SpeckKit registry — a governance framework for code standards, UI references, and spec-driven development across all projects.",
    "longDescription": "SpeckKit is a centralized governance registry that provides code standards, component header templates, UI reference models, and agent behavior defaults for all projects in the portfolio.\n\nIt enforces consistency through Git submodules, auto-applied code standards, and structured UI reference catalogs. Every project in the Generic ecosystem references SpeckKit for its engineering standards.\n\nKey capabilities:\n- Component header comment block templates\n- UI reference catalog (D365 grid patterns, layout models)\n- Agent behavior defaults for AI coding assistants\n- System manifest index for project discovery",
    "repoUrl": "https://github.com/bradlaw76/SpeckKit-Project-Development",
    "screenshots": [],
    "tags": ["Governance", "Code Standards", "SpeckKit"],
    "dateCreated": "2026-02-16",
    "lastUpdated": "2026-02-16",
    "origin": "Web"
  },
  {
    "id": "specify",
    "name": "Specify CLI",
    "version": "1.0.0",
    "status": "Active",
    "priority": "Normal",
    "category": "Development",
    "description": "Guidance and commands for the Specify CLI to generate or update project specifications.",
    "longDescription": "The Specify CLI produces structured project specifications. This entry provides in-app guidance and safe commands to run in your terminal.\n\nUsage:\n- Show help: specify --help\n- Generate/update spec: specify generate --output spec.chatgpt\n\nNote: The app is static and does not run CLIs in-browser. See the SpeckKit page for governance and standards.",
    "repoUrl": "#/speckkit",
    "screenshots": [],
    "tags": ["CLI", "Specification", "Governance"],
    "dateCreated": "2026-02-17",
    "lastUpdated": "2026-02-17"
  }
]
